Repository: abdelrahman-mahmoud-salah/SharkShop
Catalog: lib/l10n/app_*.arb
Languages: ar

# language
source: العربية
ar: English

# app_name
source: Asroo Store
ar: متجر آسرو

source: Login
ar: تسجيل الدخول

# welcome
source: Welcome, Please enter your email and get started.
ar: مرحباً! الرجاء إدخال بريدك إلكتروني والبدء.

source: Your Email
ar: بريدك الالكتروني

source: Password
ar: كلمة المرور

# valid_email
source: Please enter a valid email
ar: من فضلك إدخال البريد الإلكتروني الصحيح

# valid_passwrod
source: Please enter a valid password, not less than 6 characters
ar: من فضلك إدخال كلمة مرور صحيحة، لا تقل عن 6 أحرف

# logged_successfully
source: You have been logged in successfully
ar: تم تسجيل الدخول بنجاح

# logged_error
source: There was an error logging in. Try again
ar: هناك خطأ في تسجيل الدخول اعد المحاولة

source: Create account
ar: إنشاء حساب

# sign_up_welcome
source: Welcome, Please add your information
ar: مرحبا، الرجاء إضافة المعلومات الخاصة بك

# question_have_account
source: If you don't have any account ? Please do a :
ar: لو انت ليس لديك اي حساب من فضلك قم بـ

source: Sign Up
ar: آنشاء حساب

# you_have_account
source: You have an account?
ar: لديك حساب

source: Full Name
ar: الاسم الكامل

# valid_name
source: Please enter your full name
ar: من فضلك إدخال اسمك كاملا

# valid_pick_image
source: Please Select Your Image Avatar
ar: الرجاء تحديد الصورة الرمزية الخاصة بك

# image_uploaded
source: The image has been uploaded successfully.
ar: تم تحميل الصورة بنجاح

# image_removed
source: The image has been Deleted.
ar: تم مسح الصورة

# choose_products
source: Choose Your Products
ar: اختر منتجاتك آلان

source: Application Features
ar: مميزات التطبيق

# language_tilte
source: Language
ar: اللغة

# change_to_the_language
source: Do you want to confirm the language change to Arabic?
ar: هل تريد تأكيد تغيير اللغة إلى اللغة الإنجليزية؟

source: Sure
ar: تآكيد

source: Cancel
ar: إلغاء

source: Build Version
ar: نسخة التطبيق

source: Build Developer
ar: مطور التطبيق

source: Logout
ar: تسجيل خروج

# log_out_from_app
source: Do you want log out?
ar: هل تريد تسجيل الخروج؟

source: Yes
ar: نعم

source: No
ar: لا

source: Dark Mode
ar: الوضع الليلي

# lang_code
source: English
ar: العربية

source: Notifications
ar: إشعارات

# subscribed_to_notifications
source: Notifications have been subscribed
ar: تم الاشتراك في إشعارات

# unsubscribed_to_notifications
source: Notifications have been unsubscribed
ar: تم إلغاء الاشتراك في إشعارات

source: View all
ar: شاهد الكل

source: products
ar: المنتجات

source: categories
ar: المنتجات

source: All categories
ar: كل الأقسام

source: All Products
ar: كل المنتجات

# error_allproducts
source: An error occurred while fetching products
ar: حدثت مشكله عند طلب البيانات

source: Add
ar: اضافه

source: error
ar: خطأ

source: Delete
ar: مسح

source: Edit
ar: تعديل

source: Add a photo
ar: اضافه صوره

source: Remove
ar: ازاله

# enter_name_category
source: Enter Category Name
ar: قم بادخال اسم المنتج

source: Categor Name
ar: اسم المنتج

source: Update Category
ar: تحديث المنتج

# empty_category
source: Not Found Category
ar: لا يوجد منتجات

# is_created
source: You have been created in successfully
ar: تمت الاضافه

# not_created
source: You don't have been created in successfully ,try again
ar: حدثت مشكله عند التحديث حاول مره اخري

# is_updated
source: Category is updated successfully
ar: تمت عملية التحديث

# not_updated
source: You don't have been Update in successfully ,try again
ar: حدثت مشكله عند التحديث حاول مره اخري

# is_delete
source: You have been Delete in successfully
ar: تمت حذف الصنف

# not_delete
source: You don't have been Delete in successfully ,try again
ar: حدثت مشكله عند حذف حاول مره اخري

source: Create Product
ar: اضافة منتج

source: Create a photos
ar: اضافة صوره

source: Users
ar: المستخدمين

# empty_users
source: Not Found Any Users
ar: لا يوجد مستخدمين

source: search
ar: البحث

source: Name
ar: الاسم

source: Email
ar: البريد الالكتروني

source: Your Favorite
ar: المفضله

# empty_favorite
source: not found any favorites
ar: لا يوجد منتجات مفضله

source: Your Notification
ar: الاشعارات
